{
    "bentley": {
        "id": "bentley",
		"name": "Samantha Bentley",
		"description": "Bentley was born and raised in South London, England. She stripped while attending university, where she studied design, before working in pornography. Bentley started glamour modelling when she was around 18 or 19 years old and has appeared in Page 3 of The Sun. She decided to enter the adult film industry after an ex-boyfriend told her it would be 'cool' if she were a porn star. She began by filming her own amateur videos, which are no longer in her possession. When she was 20 years old, she performed solo for a British tease website which posted her work under the name Samantha B, Samantha being her real first name. She initially wanted to use the stage name Pixie May, but a friend of hers suggested she use a name similar to the one from the tease site in order to make it easier for fans to find her. She initially worked for two years in girl/girl scenes only. She did her first scene, which was for 21Sextury, at the age of 22 in Budapest with a Czech female performer. Her first boy/girl scene was with Ian Tate for Harmony Films. This was also her first anal sex scene. She was the Penthouse Pet of the Month for August 2015."
	},
    "kova": {
        "id": "kova",
		"name": "Kataxenna Kova",
		"description": "Kataxenna Kamillia Kova (born Katarzyna Kamillia Kova; 14 February 1985) is an English fetish and glamour model, best known for her latex, glamour, and pin-up modelling. She was nominated to be part of AskMen's 'Top 10 Modern Fetish models', being the only British entrant. Kataxenna Kova's style consists of pin-ups in a modern/vintage style, Playboy style glamour, and Dark Vixen fetish. She had natural breasts until 2006, when an operation took her from a natural large C cup to a DD. She has modelled for companies such as House of Harlot, Lady Lucie Latex, FairyGothMother, Torture Garden, Liberation, Libidex, Loaded Magazine, Deisoulle, Playboy Europe, Metal Hammer, and Classic Rock. She has also modelled for US company Action Girls, which helped to popularise notable models such as Veronika Zemanova. She was the centrefold in Metal Hammer UK's 'Maidens of Metal' 2010 calendar. In July 2015, she was featured on the cover of Femme Rebelle Magazine. She is also an actress, and in 2006 starred in her first lead film role in horror B-movie FrightWorld. Her first screen work goes back to her childhood but she chose to pursue music over acting during that time."
	},
	"tate": {
        "id": "tate",
		"name": "Tanya Tate",
		"description": "Tanya Tate (born 31 March 1979) is an English glamour model, writer, international cosplayer, and pornographic actress. After beginning her porn career in 2009, Tate began contributing to a regular column for British adult magazine Ravers DVD in 2010. Her alliterative stage name is inspired by her interest in comic books and how Stan Lee similarly named his characters. She is perhaps best known for her contributions to the MILF genre, with eleven MILF of the Year wins. Tate is also known for her appearances in porn parodies such as Game of Bones (an adult parody of Game of Thrones), The Incredible Hulk XXX, and Iron Man XXX."
	},
    "cora": {
        "id": "cora",
		"name": "Sexy Cora",
		"description": "Sexy Cora (born Carolin Ebert, civil name Carolin Wosnitza; 2 May 1987 – 20 January 2011) was a German pornographic actress, model, singer, exotic dancer, wife of Tim Wosnitza, and reality show participant. Cora was born in Berlin. She was one of the participants of the 10th season of Big Brother Germany. Cora released two music singles after her Big Brother participation: 'My Love – La, La, La' and 'Lass uns kicken (Alles klar wunderbar)"
	},
    "magma": {
        "id": "magma",
		"name": "Mia Magma",
		"description": "Mia Julia Brückner (born 9 December 1986), best known as Mia Magma, Mia Julia and Fellucia, is a German pornographic actress. Magma's life-size image appeared at the 2011 24 Hours Nürburgring on a BMW touring car sponsored by pornographic company Magmafilm, and she even attended the event as a special guest. In Summer 2012, she was also part of the 2012 touring music show Bierkönig. In late 2011, Magma also appeared on the K.I.Z music video of the song 'Fremdgehen', and featured a series of commercials for the airline 'Germanwings'. In September 2012, Magma announced her retirement from pornography to pursue a career in music and television with the new stage name Mia Miya. For this reason she even withdrew a Venus Award nomination. Magma appeared on several magazine covers, including the May 2012 German issue of FHM and the October 2012 German issue of Penthouse."
	},
    "banks": {
        "id": "banks",
		"name": "Briana Banks",
		"description": "Briana Banks (born Briana Bany; 21 May 1978) is a German American pornographic actress and model. She was the Penthouse Pet of the Month for June 2001. Banks modeled as a teenager, appearing on a cover of Teen magazine. She entered the industry under the name 'Mirage', but began calling herself 'Briana Banks' in 1999, after having the first of two breast enlargement operations. Having had aspirations of being a supermodel, she chose the professional surname 'Banks' after model Tyra Banks. Her first appearance using the new name was in the film Decadent Whores 9. In June 2001, Banks was Penthouse magazine's Pet of the Month."
	},
    "tran": {
        "id": "tran",
		"name": "Céline Tran",
		"description": "Céline Tran (born 9 April 1979) is a French actress, writer, martial artist, blogger, and former pornographic actress, previously known under the stage name Katsuni. She started her adult film career in 2001, working first in France, then in the United States. She received numerous awards in the course of the adult career, most notably the AVN Award for Female Foreign Performer of the Year which she has won three times. She retired from porn in 2013 and returned to France to pursue a career in mainstream entertainment under her real name. Tran has appeared in films such as the French comedy Porn in the Hood (2012), and Cambodian action film Jailbreak (2017). She also released an autobiography, Ne dis pas que tu aimes ça, in 2018."
	},
    "polina": {
        "id": "polina",
		"name": "Anna Polina",
		"description": "Anna Polina (born 11 September 1989, in Leningrad) is a Russian-French pornographic actress and model. Polina debuted in the adult industry in 2010; since then she has appeared in over 30 productions. In 2010, Polina starred in the independent horror film Echap. In 2011 she appeared in two television documentaries about adult industry, France 2's Le Rhabillage and Direct 8's Star du X, comment en sortir indemne ?. In April 2012 she appeared in a campaign for the breast cancer prevention. She also appeared in advertisements of Yamaha number 69 driven by Hugo Payen in the 2012 Dakar Rally."
	},
    "morgane": {
        "id": "morgane",
		"name": "Clara Morgane",
		"description": "Clara Morgane (French pronunciation: ​[klaʁa mɔʁɡan]; born Emmanuelle Munos, 25 January 1981) is a French singer, media personality, television host and former pornographic actress. Clara Morgane first became notable as a porn star : she started making movies with her boyfriend Greg Centauro and Pierre Piot in 2000 and, after a few amateur shoots, became a professional actress. She stopped her porn career after only two years and seven movies, eventually ending her relationship with Centauro who did not wish to leave the porn industry. In 2001, she started hosting on Canal+ Le Journal du hard, a magazine dedicated to the industry. She hosted it for seven years. In 2003, she published her first autobiography, Sex Star."
	},
    "henger": {
        "id": "henger",
		"name": "Éva Henger",
		"description": "Éva Henger (born 2 November 1972) is an Italian-Hungarian actress, television personality, singer, model, influencer, and former pornographic actress. Henger is very popular in Italy where she has been a guest in various programmes, and has also hosted an edition of Paperissima Sprint. In addition to this, she had a minor role in Gangs of New York."
	},
    "nappi": {
        "id": "nappi",
		"name": "Valentina Nappi",
		"description": "Valentina Nappi (born 6 November 1990) is an Italian pornographic movie actress and adult model. Born in Scafati, near Salerno, Nappi made her debut in the adult industry in 2011 with director Rocco Siffredi after she contacted him via e-mail. She graduated from art school in Salerno and, as of October 2013, she studied art and design at a university. Often referred to as an 'intellectual pornstar', Nappi wrote several essays on the condition of men and women in contemporary society and attended a philosophy festival. She was a Playmate in the Italian issue of Playboy in June 2012 and Penthouse Pet of the Month in November 2013. As of March 2015, she writes a column in the political and social magazine MicroMega."
	},
    "tommasi": {
        "id": "tommasi",
		"name": "Sara Tommasi",
		"description": "Sara Tommasi (born 9 June 1981) is an Italian actress, television personality, and former pornographic actress. She made her film debut in the 2008 comedy Ultimi della classe, playing a teacher who had appeared in a 'sexy' calendar shoot. Tommasi herself had appeared topless in a Max Calendar shoot in 2007. In 2010, she appeared nude in an episode of the television series Crimini. She has dated footballers Mario Balotelli and Ronaldinho. She was an attendee at former prime minister Silvio Berlusconi's private parties."
	},
    "norai": {
        "id": "norai",
		"name": "Bibian Norai",
		"description": "Bibian Norai (born 1 September 1967) is a Spanish pornographic actress. She won FICEB Ninfa Awards for Best Spanish Actress (The Fetish Garden) in 2003 and Best Director (Public) in 2004. Norai was the artistic director of the Salon Erotico de Barcelona. She had been affiliated with the film festival and its predecessor for over twenty years, first as an actress near the beginning of her career and then in various aspects of its production after 2003. During her time, she created a section at the show dedicated to women consumers and producers. She resigned as artistic director in 2018 over what she saw was the decline of the show."
	},
    "miller": {
        "id": "miller",
		"name": "Amarna Miller",
		"description": "Amarna Miller is a Spanish YouTuber and former adult film actress, producer, director and writer. Miller, whose stage name comes from an Egyptian archaeological site Amarna and the writer Henry Miller, graduated in fine arts from the European University of Madrid. Miller joined the adult film industry at 19 years of age, operating her own film production company called Omnia-X for five years. She has appeared in the magazines PlayGround and Primera Línea and on the Orgasmatrix website."
	},
    "linares": {
        "id": "linares",
		"name": "Rebeca Linares",
		"description": "Rebeca Linares (born 13 June 1983) is a Spanish pornographic actress and Penthouse Pet. Although born in San Sebastián, Basque Autonomous Community, Spain, she has lived for many years in Barcelona. She chose Rebeca for her stage name because 'it's short and very strong' and Linares is her actual last name. Linares began appearing in adult movies in 2005 in Spain; her best friend was a friend of Spanish adult star Nacho Vidal. Due to the low volume of work and money in Spain, she began working in other parts of Europe, such as Berlin and France. She moved to Los Angeles in March 2006. Linares said about her move, 'I wanted to stay in one place, living and working every day, and here is the whole business.'"
	},
    "eden": {
        "id": "eden",
		"name": "Bobbi Eden",
		"description": "Bobbi Eden (born 4 January 1980) is a Dutch pornographic actress and international magazine model. She was the runner-up for the Dutch Penthouse Pet of the Year. She had also modeled for magazines including Club, Men Only, and Soho. She appeared with Dutch DJ Ferry Corsten in the video for his single 'Watch Out'. In the video, a tiny Corsten races around in a model racing car while Bobbi looms overhead with the remote control. She has written columns for the magazines Passie and Chick, and currently writes for the magazine Panorama."
	},
    "leur": {
        "id": "leur",
		"name": "Verona van de Leur",
		"description": "Verona van de Leur (born 27 December 1985) is a retired Dutch artistic gymnast and adult film performer. She was named Dutch Sportswoman of the Year in 2002 after winning the all-around silver medal at that year's European championships and the silver medal on floor exercise at the world championships. Van de Leur retired from gymnastics in 2008, after which she suffered personal difficulties, including a conviction for blackmail and a prison sentence. She began performing in adult webcam shows and then in adult films."
	},
    "whites": {
        "id": "whites",
		"name": "Zara Whites",
		"description": "Zara Whites (born Esther Kooiman, 8 November 1968) is a French-Dutch former pornographic film actress. Zara Whites dropped out of school at an early age and moved in with her boyfriend when she was 17. In her late teens she worked as a barmaid and at the age of 19, as a prostitute in two men's clubs in Rotterdam. In 1992, she was briefly married to Italian porn actor Roberto Malone and reoriented her career towards non-sex roles in soft core with a French TV series for M6, Joy. In 1998, she made a comeback with a lesbian hardcore movie, La Dresseuse directed by Alain Payet."
	},
    "wild": {
        "id": "wild",
		"name": "Angelika Wild",
		"description": "Angelika Wild (Katowice, Polonia;1​ 30 de octubre de 1982) es una actriz pornográfica polaca radicada en Italia. Hace sólo unos años, Angelika Wild era una adolescente apasionada por el baile que actuaba en espectáculos eróticos en Polonia. Pese a haberse criado en una familia católica tradicional, es una mujer liberal que disfruta con el contacto del público en las actuaciones en vivo y que, en 2001, consiguió un contrato para trabajar en Italia. Sin dudarlo, abandonó su casa y su familia y se marchó a Turín, donde, poco tiempo después, recibió una oferta para participar en una película X."
	},
    "starr": {
        "id": "starr",
		"name": "Natasha Starr",
		"description": "Natasha Starr (ur. 10 października 1987 w Ostrowi Mazowieckiej) – polska aktorka pornograficzna, mieszkająca na stałe w Stanach Zjednoczonych. Jest siostrą Natalii Starr, także aktorki pornograficznej, ponieważ obie są popularne w branży jako Siostry Starr. Urodziła się w Ostrowi Mazowieckiej, gdzie ukończyła Szkołę Podstawową Nr 1 im. Tadeusza Kościuszki i rozpoczęła naukę w pierwszej klasie gimnazjum. W 2000, w okresie Bożego Narodzenia, w wieku 13 lat wyemigrowała do Stanów Zjednoczonych, gdzie zamieszkała z rodzicami, dwiema siostrami i bratem[8] w nowojorskich dzielnicach Williamsburg, Brooklyn i Queens. Studiowała w szkole kosmetologii i przez dwa lata pracowała w salonie kosmetycznym."
	},
    "pink": {
        "id": "pink",
		"name": "Laureen Pink",
		"description": "Laureen Pink (* 1983 in Olsztyn, Polen) ist eine polnische Pornodarstellerin, die nach ihrer Karriere in Deutschland und der Schweiz wieder in Polen lebt. Laureen Pink kam über die Swinger-Szene zum Porno. Zusammen mit ihrem Mann veranstaltet sie Gangbang-Partys und produziert Pornofilme. Gerhard Haase-Hindenberg schreibt in seinem Buch Die enthemmten Deutschen – Von der neuen Lust auf Sex unter anderem über Laureen Pinks Partys. Inzwischen hat Sie sich aus der Branche zurückgezogen und betreibt in ihrer Heimat ein Bauernhof."
	},
    "swede": {
        "id": "swede",
		"name": "Puma Swede",
		"description": "Johanna Jussinniemi (born 13 September 1976), better known by her stage name Puma Swede, is a Swedish pornographic actress and feature dancer. The first part of her stage name comes from the sports car, the Ford Puma. Since 2005, she has appeared in over 200 movies. She is of Finnish descent, as both her parents were originally from Finland, and she has resided in California since 2004. Worked as a computer sales representative in Sweden and later on as a glamour model before moving into adult films. She initially only performed in girl–girl scenes, but made her hardcore boy–girl debut in the 2005 video School of Hardcore by the studio AntiInnocence Video, with whom she was previously a contract performer."
	},
    "thoren": {
        "id": "thoren",
		"name": "Linda Thorén",
		"description": "Linda Angelica Thorén (Örnsköldsvik; 24 de septiembre de 1977) es una actriz pornográfica sueca. Hizo su primera aparición pornográfica a los 18 años.1​ Ha trabajado en Europa, los Estados Unidos y Asia."
	},
    "marijke": {
        "id": "marijke",
		"name": "Hot Marijke",
		"description": "Hot Marijke (Kapellen, 17 juli 1986) is een Vlaamse in SM gespecialiseerde prostituee, columniste, pornoactrice en camgirl. Tijdens een erotische fotosessie in 2005 kwam ze in contact met haar latere man en manager met wie ze haar pseudoniem Hot Marijke bedacht. Ze startte als foto/filmmodel, camgirl en breidde haar activiteiten vervolgens uit naar (erotische) SM, prostitutie (privé-ontvangst en escort), striptease en het geven van seksadvies."
	},
    "mcreese": {
        "id": "mcreese",
		"name": "Tilly McReese",
		"description": "Irish glamour model and pornographic actress"
	},
    "otoole": {
        "id": "otoole",
		"name": "Kelly O'Toole",
		"description": "Irish pornographic actress"
	},
    "ireland": {
        "id": "ireland",
		"name": "Kylie Ireland",
		"description": "Kylie Ireland (born May 26, 1970) is an American pornographic actress, film director, producer, publicist, and satellite radio show host. She is an inductee into the AVN, XRCO, and NightMoves Halls of Fame. Ireland returned to Colorado to continue college partially in Boulder, Colorado, partially in Fort Collins, Colorado, and began to dance in a Fort Collins strip club. One of her first female lovers was a waitress at the same club who would become the pornographic actress Juli Ashton."
	}
}
